Revit 2027 API
TableView.MaximumGridWidth Property
 Gets the allowed maximum grid width
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int MaximumGridWidth { get; }
Public ReadOnly Property MaximumGridWidth As Integer
	Get
public:
property int MaximumGridWidth {
	int get ();
}
member MaximumGridWidth : int with get
Property Value
Int32
See Also
Reference
TableView Class
Autodesk.Revit.DB Namespace